//let number = 7; /* можна поиіняти в майбутньому */
//const pi = 3.14 /* не можна поміняти */ 

//number = 4; /* поміняв значення перемінної number */


//Типи данних:
//number = 7; /* числа */
//String = "максим" /* строка */
//true/false
//null /* коли чогось просто не існує */
//undefined /* коли щось існує але значення ніякого не має */ приклад: let git;
//Symbol 
//{ /* обєкт-може тримати в собі всі інші типи данних */
//    name: "apple"
//    color: 'red'
//    weight: 500
//};

//взаємодія з користувачом:
//alert(fuck off) /* виводить інформацію яка написана в скобках на сайт без можливості щось відповісти */
//console.log('тут помилка numder') /* використовується для того щоб говорити з розробником який пише цей скріпт */

//let qweshin = confirm('тобі є 18 років?'); /* виводить інформацію яка написана в скобках на сайт (можу відповісти) */
//console.log(qweshin); /* ввижу що відповів користувач true або false */

//let qweshin = prompt('тобі є 18 років?', '');
//console.log(qweshin) /* ввижу що відповів користувач (то що він захотів) */